"""
1.	Підготовка середовища та завантаження даних
    1.1.	Імпортуйте необхідні бібліотеки.
    1.2.	Завантажте файл Job opportunities.csv
    1.3.	Оскільки Salary Range - текстове поле, створіть числову колонку Average Salary
2.	Створення стовпчастої діаграми (Barplot)
    2.1.	Побудуйте діаграму, яка показує залежність середньої зарплати (Average Salary) від рівня досвіду (Experience Level).
    2.2.	Дайте відповідь на запитання про те, як змінюється середня зарплата залежно від рівня досвіду.
3.	Створення діаграми розмаху (Boxplot)
    3.1.	Створіть діаграму розмаху для відображення розподілу зарплат (Average Salary) за галузями (Industry).
    Підказка: Щоб підписи по осі X не накладалися, можна використати:
    plt.figure(figsize=(12, 6))   -  більше місця для діаграми;
    plt.xticks(rotation=45, ha='right') - ha='right' запобігає накладанню тексту;
    plt.tight_layout() - автоматично підлаштовує відступи.
    3.2.	Зробіть висновок про те, у яких галузях спостерігається вищий рівень зарплат і більший розкид значень порівняно з іншими.
4.	Створення теплової карти (Heatmap)
    4.1.	Створіть теплову карту для аналізу кількості вакансій за рівнем досвіду (Experience Level) та галуззю (Industry). 
    Підказка: Можна припустити, що кількість вакансій рівна кількості рядків у датафреймі. Тоді скористатися crosstab(), що підрахує кількість рядків у датафреймі df, які одночасно мають певний рівень досвіду та відносяться до певної галузі:
    pivot_table = pd.crosstab(df['Experience'], df['Industry'])
    Або ж використати groupby()   
    4.2.	Зробіть висновок про те, де спостерігається найбільша кількість вакансій.
5.	Створення точкової діаграми (Scatterplot)
    5.1.	Відобразіть залежність зарплати (Average Salary) від року публікації вакансії (Year, треба витягнути з Date Posted). Точки на графіку пофарбуйте за рівнем досвіду (hue='Experience Level').
    5.2.	Зробіть висновки коли спостерігається тенденція до зростання зарплат, для вакансій з яким рівнем досвіду.
6.	 Парні графіки (Pairplot)
    6.1.	Створіть парні графіки для аналізу взаємозв’язків між зарплатою, роком та рівнем досвіду.
    6.2.	Зробіть висновки з отриманих залежностей та в чому полягає відмінність точкової діаграми від парних графіків.
7.	Зробіть загальні висновки про роботу
"""
