"""
1.	Створити базу даних та таблицю nodes, яка зберігатиме інформацію про мережеві вузли (ID, IP-адресу, статус). 
2.	Реалізувати асинхронну функцію для отримання списку вузлів із бази. 
3.	Реалізувати асинхронну систему збору статусів вузлів (імітація мережевих запитів). 
4.	Зберігати отримані дані у базі за допомогою SQLAlchemy. 
5.	Продемонструвати та пояснити результати виконання програми (створення таблиці, додавання 10-15 вузлів, моніторинг з оновленням статусу, виведення списку вузлів до та після оновлення і т.д.).
"""
