"""
1. Імпорт та первинний аналіз даних
Завантажити CSV-файл у DataFrame.
Вивести перші 5 та останні 5 рядків таблиці.
Визначити кількість рядків і стовпців.
Обчислити обсяг пам’яті, який займає датасет.

2. Аналіз структури та типів даних
Переглянути типи даних усіх стовпців.
Переконатися, чи є пропущені значення.
Зробити висновок щодо якості даних.

3.	Фільтрація вакансій за умовами
Відібрати вакансії у певній сфері (наприклад,  Cloud Computing).
Знайти вакансії з рівнем Senior.
Відібрати вакансії типу Full-Time у конкретному місті.

4.	Сортування даних за зарплатою
Відсортувати вакансії за рівнем оплати (Salary Range).
Вивести 5 вакансій з найвищою зарплатою.
Визначити, які посади є найбільш високооплачуваними.
Примітка: Salary Range подано у текстовому форматі. 

5.	Групування та агрегатні функції
Згрупувати вакансії за галузями (Industry).
Для кожної галузі визначити: 
•	кількість вакансій;
•	середню мінімальну зарплату.
Визначити галузь з найвищою середньою зарплатою.

6.	Використання apply() для створення нових ознак
Створити новий стовпець Salary Category:
•	Low - до 40 000;
•	Medium - 40 001 – 70 000;
•	High - понад 70 000.
Перевірити правильність категоризації.
Примітка: Щоб враховувати весь діапазон зарплати при категоризації, потрібно виділити максимальне значення з Salary Range і використовувати його у функції. 

7.	Часовий аналіз ринку вакансій
Перетворити колонку Date Posted у формат datetime.
Створити нову колонку Year. 
Примітка: Перетворіть стовпець Date Posted у формат дати за допомогою pd.to_datetime(). Використайте .dt.year, щоб отримати рік публікації та створити новий стовпець Year.
Проаналізувати кількість вакансій за роками та які роки були найбільш активними.
Примітка: Згрупуйте дані за роком, використовуючи groupby(). Для підрахунку кількості вакансій застосуйте метод agg() з функцією count() до стовпця Job Title.
Проаналізуйте отриману таблицю з кількістю вакансій за роками.

8.	Зробіть висновки. 
При виконанні лабораторної роботи створіть різні класи для окремих функцій (імпорт даних, фільтрування, групування тощо). 
"""
